import { CityDistrictData } from '../types';

export const TAIWAN_LOCATIONS: CityDistrictData[] = [
  {
    "city": "台北市",
    "lat": 25.0375,
    "lng": 121.5637,
    "districts": [
      {
        "name": "中正區",
        "lat": 25.0324,
        "lng": 121.5194
      },
      {
        "name": "大同區",
        "lat": 25.0632,
        "lng": 121.5133
      },
      {
        "name": "中山區",
        "lat": 25.0685,
        "lng": 121.5332
      },
      {
        "name": "松山區",
        "lat": 25.0592,
        "lng": 121.5575
      },
      {
        "name": "大安區",
        "lat": 25.0264,
        "lng": 121.5435
      },
      {
        "name": "萬華區",
        "lat": 25.0354,
        "lng": 121.4997
      },
      {
        "name": "信義區",
        "lat": 25.0339,
        "lng": 121.5644
      },
      {
        "name": "士林區",
        "lat": 25.0938,
        "lng": 121.5248
      },
      {
        "name": "北投區",
        "lat": 25.1321,
        "lng": 121.4987
      },
      {
        "name": "內湖區",
        "lat": 25.0835,
        "lng": 121.5898
      },
      {
        "name": "南港區",
        "lat": 25.0384,
        "lng": 121.6067
      },
      {
        "name": "文山區",
        "lat": 24.9986,
        "lng": 121.5701
      }
    ]
  },
  {
    "city": "新北市",
    "lat": 25.0169,
    "lng": 121.4628,
    "districts": [
      {
        "name": "板橋區",
        "lat": 25.0114,
        "lng": 121.4627
      },
      {
        "name": "三重區",
        "lat": 25.0717,
        "lng": 121.4881
      },
      {
        "name": "中和區",
        "lat": 24.9994,
        "lng": 121.4994
      },
      {
        "name": "永和區",
        "lat": 25.0084,
        "lng": 121.5152
      },
      {
        "name": "新莊區",
        "lat": 25.0375,
        "lng": 121.4503
      },
      {
        "name": "新店區",
        "lat": 24.9681,
        "lng": 121.5417
      },
      {
        "name": "樹林區",
        "lat": 24.9912,
        "lng": 121.4253
      },
      {
        "name": "鶯歌區",
        "lat": 24.9547,
        "lng": 121.3547
      },
      {
        "name": "三峽區",
        "lat": 24.9347,
        "lng": 121.3712
      },
      {
        "name": "淡水區",
        "lat": 25.1758,
        "lng": 121.4428
      },
      {
        "name": "汐止區",
        "lat": 25.0631,
        "lng": 121.6587
      },
      {
        "name": "瑞芳區",
        "lat": 25.1089,
        "lng": 121.8105
      },
      {
        "name": "土城區",
        "lat": 24.9723,
        "lng": 121.4444
      },
      {
        "name": "蘆洲區",
        "lat": 25.0848,
        "lng": 121.4744
      },
      {
        "name": "五股區",
        "lat": 25.0833,
        "lng": 121.4394
      },
      {
        "name": "泰山區",
        "lat": 25.0594,
        "lng": 121.4286
      },
      {
        "name": "林口區",
        "lat": 25.0775,
        "lng": 121.3917
      },
      {
        "name": "深坑區",
        "lat": 25.0022,
        "lng": 121.6156
      },
      {
        "name": "石碇區",
        "lat": 24.9917,
        "lng": 121.6586
      },
      {
        "name": "坪林區",
        "lat": 24.9372,
        "lng": 121.7111
      },
      {
        "name": "三芝區",
        "lat": 25.2583,
        "lng": 121.5008
      },
      {
        "name": "石門區",
        "lat": 25.2906,
        "lng": 121.5683
      },
      {
        "name": "八里區",
        "lat": 25.1467,
        "lng": 121.3986
      },
      {
        "name": "平溪區",
        "lat": 25.0256,
        "lng": 121.7386
      },
      {
        "name": "雙溪區",
        "lat": 25.0333,
        "lng": 121.8653
      },
      {
        "name": "貢寮區",
        "lat": 25.0222,
        "lng": 121.9083
      },
      {
        "name": "金山區",
        "lat": 25.2219,
        "lng": 121.6389
      },
      {
        "name": "萬里區",
        "lat": 25.1783,
        "lng": 121.6886
      },
      {
        "name": "烏來區",
        "lat": 24.8653,
        "lng": 121.5506
      }
    ]
  },
  {
    "city": "基隆市",
    "lat": 25.1276,
    "lng": 121.7392,
    "districts": [
      {
        "name": "仁愛區",
        "lat": 25.1278,
        "lng": 121.7417
      },
      {
        "name": "中正區",
        "lat": 25.1508,
        "lng": 121.7675
      },
      {
        "name": "信義區",
        "lat": 25.1289,
        "lng": 121.7647
      },
      {
        "name": "中山區",
        "lat": 25.1439,
        "lng": 121.7308
      },
      {
        "name": "安樂區",
        "lat": 25.1239,
        "lng": 121.7144
      },
      {
        "name": "暖暖區",
        "lat": 25.1011,
        "lng": 121.7389
      },
      {
        "name": "七堵區",
        "lat": 25.0958,
        "lng": 121.7139
      }
    ]
  },
  {
    "city": "桃園市",
    "lat": 24.9936,
    "lng": 121.301,
    "districts": [
      {
        "name": "桃園區",
        "lat": 24.9936,
        "lng": 121.301
      },
      {
        "name": "中壢區",
        "lat": 24.9656,
        "lng": 121.225
      },
      {
        "name": "平鎮區",
        "lat": 24.9458,
        "lng": 121.2183
      },
      {
        "name": "八德區",
        "lat": 24.9286,
        "lng": 121.2831
      },
      {
        "name": "楊梅區",
        "lat": 24.9089,
        "lng": 121.1458
      },
      {
        "name": "大溪區",
        "lat": 24.8839,
        "lng": 121.2869
      },
      {
        "name": "龜山區",
        "lat": 24.9939,
        "lng": 121.3389
      },
      {
        "name": "蘆竹區",
        "lat": 25.0467,
        "lng": 121.2917
      },
      {
        "name": "大園區",
        "lat": 25.0644,
        "lng": 121.1969
      },
      {
        "name": "觀音區",
        "lat": 25.0361,
        "lng": 121.0825
      },
      {
        "name": "新屋區",
        "lat": 24.9722,
        "lng": 121.0167
      },
      {
        "name": "龍潭區",
        "lat": 24.8639,
        "lng": 121.2164
      },
      {
        "name": "復興區",
        "lat": 24.8219,
        "lng": 121.3525
      }
    ]
  },
  {
    "city": "新竹市",
    "lat": 24.8138,
    "lng": 120.9675,
    "districts": [
      {
        "name": "東區",
        "lat": 24.8014,
        "lng": 120.9714
      },
      {
        "name": "北區",
        "lat": 24.8164,
        "lng": 120.9575
      },
      {
        "name": "香山區",
        "lat": 24.7644,
        "lng": 120.9239
      }
    ]
  },
  {
    "city": "新竹縣",
    "lat": 24.8387,
    "lng": 121.0177,
    "districts": [
      {
        "name": "竹北市",
        "lat": 24.8387,
        "lng": 121.0177
      },
      {
        "name": "竹東鎮",
        "lat": 24.7339,
        "lng": 121.0917
      },
      {
        "name": "新埔鎮",
        "lat": 24.8258,
        "lng": 121.0728
      },
      {
        "name": "關西鎮",
        "lat": 24.7939,
        "lng": 121.1764
      },
      {
        "name": "湖口鄉",
        "lat": 24.9039,
        "lng": 121.0436
      },
      {
        "name": "新豐鄉",
        "lat": 24.8986,
        "lng": 120.9839
      },
      {
        "name": "芎林鄉",
        "lat": 24.7739,
        "lng": 121.0792
      },
      {
        "name": "橫山鄉",
        "lat": 24.7208,
        "lng": 121.1147
      },
      {
        "name": "北埔鄉",
        "lat": 24.6997,
        "lng": 121.0575
      },
      {
        "name": "寶山鄉",
        "lat": 24.7611,
        "lng": 120.9875
      },
      {
        "name": "峨眉鄉",
        "lat": 24.6861,
        "lng": 121.0175
      },
      {
        "name": "尖石鄉",
        "lat": 24.7064,
        "lng": 121.2039
      },
      {
        "name": "五峰鄉",
        "lat": 24.6314,
        "lng": 121.1194
      }
    ]
  },
  {
    "city": "苗栗縣",
    "lat": 24.5602,
    "lng": 120.8214,
    "districts": [
      {
        "name": "苗栗市",
        "lat": 24.5602,
        "lng": 120.8214
      },
      {
        "name": "頭份市",
        "lat": 24.6881,
        "lng": 120.8953
      },
      {
        "name": "竹南鎮",
        "lat": 24.6864,
        "lng": 120.8778
      },
      {
        "name": "後龍鎮",
        "lat": 24.6167,
        "lng": 120.7864
      },
      {
        "name": "通霄鎮",
        "lat": 24.4922,
        "lng": 120.6778
      },
      {
        "name": "苑裡鎮",
        "lat": 24.4419,
        "lng": 120.6517
      },
      {
        "name": "卓蘭鎮",
        "lat": 24.3117,
        "lng": 120.8447
      },
      {
        "name": "造橋鄉",
        "lat": 24.6389,
        "lng": 120.8653
      },
      {
        "name": "西湖鄉",
        "lat": 24.5389,
        "lng": 120.7514
      },
      {
        "name": "頭屋鄉",
        "lat": 24.5778,
        "lng": 120.8639
      },
      {
        "name": "公館鄉",
        "lat": 24.5028,
        "lng": 120.8239
      },
      {
        "name": "銅鑼鄉",
        "lat": 24.4844,
        "lng": 120.7869
      },
      {
        "name": "三義鄉",
        "lat": 24.4108,
        "lng": 120.7719
      },
      {
        "name": "大湖鄉",
        "lat": 24.4239,
        "lng": 120.8647
      },
      {
        "name": "獅潭鄉",
        "lat": 24.5422,
        "lng": 120.9214
      },
      {
        "name": "三灣鄉",
        "lat": 24.6519,
        "lng": 120.9575
      },
      {
        "name": "南庄鄉",
        "lat": 24.5986,
        "lng": 121.0006
      },
      {
        "name": "泰安鄉",
        "lat": 24.4419,
        "lng": 120.9419
      }
    ]
  },
  {
    "city": "台中市",
    "lat": 24.1477,
    "lng": 120.6736,
    "districts": [
      {
        "name": "中區",
        "lat": 24.1417,
        "lng": 120.6833
      },
      {
        "name": "東區",
        "lat": 24.1378,
        "lng": 120.6975
      },
      {
        "name": "南區",
        "lat": 24.1189,
        "lng": 120.6631
      },
      {
        "name": "西區",
        "lat": 24.1436,
        "lng": 120.6639
      },
      {
        "name": "北區",
        "lat": 24.1611,
        "lng": 120.6811
      },
      {
        "name": "西屯區",
        "lat": 24.1814,
        "lng": 120.6172
      },
      {
        "name": "南屯區",
        "lat": 24.1383,
        "lng": 120.6406
      },
      {
        "name": "北屯區",
        "lat": 24.1856,
        "lng": 120.6989
      },
      {
        "name": "豐原區",
        "lat": 24.2567,
        "lng": 120.7225
      },
      {
        "name": "東勢區",
        "lat": 24.2589,
        "lng": 120.8317
      },
      {
        "name": "大甲區",
        "lat": 24.3489,
        "lng": 120.6225
      },
      {
        "name": "清水區",
        "lat": 24.2694,
        "lng": 120.5694
      },
      {
        "name": "沙鹿區",
        "lat": 24.2333,
        "lng": 120.5667
      },
      {
        "name": "梧棲區",
        "lat": 24.2547,
        "lng": 120.5317
      },
      {
        "name": "后里區",
        "lat": 24.3056,
        "lng": 120.7119
      },
      {
        "name": "神岡區",
        "lat": 24.2589,
        "lng": 120.6628
      },
      {
        "name": "潭子區",
        "lat": 24.2089,
        "lng": 120.7064
      },
      {
        "name": "大雅區",
        "lat": 24.2289,
        "lng": 120.6489
      },
      {
        "name": "新社區",
        "lat": 24.2339,
        "lng": 120.8117
      },
      {
        "name": "石岡區",
        "lat": 24.2758,
        "lng": 120.7819
      },
      {
        "name": "外埔區",
        "lat": 24.3319,
        "lng": 120.6558
      },
      {
        "name": "大安區",
        "lat": 24.3444,
        "lng": 120.5847
      },
      {
        "name": "烏日區",
        "lat": 24.1089,
        "lng": 120.6239
      },
      {
        "name": "大肚區",
        "lat": 24.1539,
        "lng": 120.5417
      },
      {
        "name": "龍井區",
        "lat": 24.1928,
        "lng": 120.5464
      },
      {
        "name": "霧峰區",
        "lat": 24.0628,
        "lng": 120.7003
      },
      {
        "name": "太平區",
        "lat": 24.1264,
        "lng": 120.7181
      },
      {
        "name": "大里區",
        "lat": 24.0994,
        "lng": 120.6775
      },
      {
        "name": "和平區",
        "lat": 24.2439,
        "lng": 120.9319
      }
    ]
  },
  {
    "city": "彰化縣",
    "lat": 24.0817,
    "lng": 120.5383,
    "districts": [
      {
        "name": "彰化市",
        "lat": 24.0817,
        "lng": 120.5383
      },
      {
        "name": "員林市",
        "lat": 23.9589,
        "lng": 120.5739
      },
      {
        "name": "鹿港鎮",
        "lat": 24.0558,
        "lng": 120.4344
      },
      {
        "name": "和美鎮",
        "lat": 24.1111,
        "lng": 120.5042
      },
      {
        "name": "北斗鎮",
        "lat": 23.8744,
        "lng": 120.5208
      },
      {
        "name": "溪湖鎮",
        "lat": 23.9619,
        "lng": 120.4811
      },
      {
        "name": "田中鎮",
        "lat": 23.8589,
        "lng": 120.5897
      },
      {
        "name": "二林鎮",
        "lat": 23.8997,
        "lng": 120.3789
      },
      {
        "name": "線西鄉",
        "lat": 24.1306,
        "lng": 120.4653
      },
      {
        "name": "伸港鄉",
        "lat": 24.1458,
        "lng": 120.4889
      },
      {
        "name": "福興鄉",
        "lat": 24.0458,
        "lng": 120.4439
      },
      {
        "name": "秀水鄉",
        "lat": 24.0358,
        "lng": 120.5019
      },
      {
        "name": "花壇鄉",
        "lat": 24.0258,
        "lng": 120.5389
      },
      {
        "name": "芬園鄉",
        "lat": 24.0158,
        "lng": 120.6289
      },
      {
        "name": "大村鄉",
        "lat": 23.9939,
        "lng": 120.5447
      },
      {
        "name": "埔鹽鄉",
        "lat": 23.9858,
        "lng": 120.4639
      },
      {
        "name": "埔心鄉",
        "lat": 23.9539,
        "lng": 120.5489
      },
      {
        "name": "永靖鄉",
        "lat": 23.9239,
        "lng": 120.5458
      },
      {
        "name": "社頭鄉",
        "lat": 23.8958,
        "lng": 120.5858
      },
      {
        "name": "二水鄉",
        "lat": 23.8089,
        "lng": 120.6178
      },
      {
        "name": "田尾鄉",
        "lat": 23.8919,
        "lng": 120.5258
      },
      {
        "name": "埤頭鄉",
        "lat": 23.8919,
        "lng": 120.4628
      },
      {
        "name": "芳苑鄉",
        "lat": 23.9239,
        "lng": 120.3208
      },
      {
        "name": "大城鄉",
        "lat": 23.8558,
        "lng": 120.3208
      },
      {
        "name": "竹塘鄉",
        "lat": 23.8339,
        "lng": 120.4208
      },
      {
        "name": "溪州鄉",
        "lat": 23.8519,
        "lng": 120.4989
      }
    ]
  },
  {
    "city": "南投縣",
    "lat": 23.9158,
    "lng": 120.6869,
    "districts": [
      {
        "name": "南投市",
        "lat": 23.9158,
        "lng": 120.6869
      },
      {
        "name": "埔里鎮",
        "lat": 23.9667,
        "lng": 120.9689
      },
      {
        "name": "草屯鎮",
        "lat": 23.9789,
        "lng": 120.6847
      },
      {
        "name": "竹山鎮",
        "lat": 23.7578,
        "lng": 120.6847
      },
      {
        "name": "集集鎮",
        "lat": 23.8289,
        "lng": 120.7847
      },
      {
        "name": "名間鄉",
        "lat": 23.8389,
        "lng": 120.7047
      },
      {
        "name": "鹿谷鄉",
        "lat": 23.7439,
        "lng": 120.7519
      },
      {
        "name": "中寮鄉",
        "lat": 23.8819,
        "lng": 120.7819
      },
      {
        "name": "魚池鄉",
        "lat": 23.8978,
        "lng": 120.9367
      },
      {
        "name": "國姓鄉",
        "lat": 24.0419,
        "lng": 120.8558
      },
      {
        "name": "水里鄉",
        "lat": 23.8119,
        "lng": 120.8558
      },
      {
        "name": "信義鄉",
        "lat": 23.6939,
        "lng": 120.8558
      },
      {
        "name": "仁愛鄉",
        "lat": 24.0239,
        "lng": 121.1347
      }
    ]
  },
  {
    "city": "雲林縣",
    "lat": 23.7092,
    "lng": 120.4313,
    "districts": [
      {
        "name": "斗六市",
        "lat": 23.7092,
        "lng": 120.5439
      },
      {
        "name": "斗南鎮",
        "lat": 23.6789,
        "lng": 120.4819
      },
      {
        "name": "虎尾鎮",
        "lat": 23.7089,
        "lng": 120.4319
      },
      {
        "name": "西螺鎮",
        "lat": 23.7819,
        "lng": 120.4619
      },
      {
        "name": "土庫鎮",
        "lat": 23.6958,
        "lng": 120.3619
      },
      {
        "name": "北港鎮",
        "lat": 23.5758,
        "lng": 120.3028
      },
      {
        "name": "古坑鄉",
        "lat": 23.6458,
        "lng": 120.5619
      },
      {
        "name": "大埤鄉",
        "lat": 23.6458,
        "lng": 120.4319
      },
      {
        "name": "莿桐鄉",
        "lat": 23.7558,
        "lng": 120.5019
      },
      {
        "name": "林內鄉",
        "lat": 23.7589,
        "lng": 120.6139
      },
      {
        "name": "二崙鄉",
        "lat": 23.7689,
        "lng": 120.4139
      },
      {
        "name": "崙背鄉",
        "lat": 23.7589,
        "lng": 120.3539
      },
      {
        "name": "麥寮鄉",
        "lat": 23.7489,
        "lng": 120.2539
      },
      {
        "name": "東勢鄉",
        "lat": 23.6789,
        "lng": 120.2539
      },
      {
        "name": "褒忠鄉",
        "lat": 23.6958,
        "lng": 120.3119
      },
      {
        "name": "台西鄉",
        "lat": 23.7019,
        "lng": 120.1989
      },
      {
        "name": "元長鄉",
        "lat": 23.6489,
        "lng": 120.3139
      },
      {
        "name": "四湖鄉",
        "lat": 23.6389,
        "lng": 120.2239
      },
      {
        "name": "口湖鄉",
        "lat": 23.5819,
        "lng": 120.1889
      },
      {
        "name": "水林鄉",
        "lat": 23.5719,
        "lng": 120.2458
      }
    ]
  },
  {
    "city": "嘉義市",
    "lat": 23.4801,
    "lng": 120.4491,
    "districts": [
      {
        "name": "東區",
        "lat": 23.4847,
        "lng": 120.4639
      },
      {
        "name": "西區",
        "lat": 23.4764,
        "lng": 120.4339
      }
    ]
  },
  {
    "city": "嘉義縣",
    "lat": 23.4518,
    "lng": 120.2555,
    "districts": [
      {
        "name": "太保市",
        "lat": 23.4589,
        "lng": 120.3319
      },
      {
        "name": "朴子市",
        "lat": 23.4658,
        "lng": 120.2464
      },
      {
        "name": "布袋鎮",
        "lat": 23.3764,
        "lng": 120.1589
      },
      {
        "name": "大林鎮",
        "lat": 23.6039,
        "lng": 120.4719
      },
      {
        "name": "民雄鄉",
        "lat": 23.5519,
        "lng": 120.4319
      },
      {
        "name": "溪口鄉",
        "lat": 23.6039,
        "lng": 120.3939
      },
      {
        "name": "新港鄉",
        "lat": 23.5539,
        "lng": 120.3464
      },
      {
        "name": "六腳鄉",
        "lat": 23.5039,
        "lng": 120.2539
      },
      {
        "name": "東石鄉",
        "lat": 23.4589,
        "lng": 120.1539
      },
      {
        "name": "義竹鄉",
        "lat": 23.3364,
        "lng": 120.2439
      },
      {
        "name": "鹿草鄉",
        "lat": 23.4119,
        "lng": 120.3089
      },
      {
        "name": "水上鄉",
        "lat": 23.4289,
        "lng": 120.3989
      },
      {
        "name": "中埔鄉",
        "lat": 23.4258,
        "lng": 120.5239
      },
      {
        "name": "竹崎鄉",
        "lat": 23.5239,
        "lng": 120.5519
      },
      {
        "name": "梅山鄉",
        "lat": 23.5839,
        "lng": 120.5564
      },
      {
        "name": "番路鄉",
        "lat": 23.4658,
        "lng": 120.5539
      },
      {
        "name": "大埔鄉",
        "lat": 23.2989,
        "lng": 120.5939
      },
      {
        "name": "阿里山鄉",
        "lat": 23.4689,
        "lng": 120.7989
      }
    ]
  },
  {
    "city": "台南市",
    "lat": 22.9997,
    "lng": 120.227,
    "districts": [
      {
        "name": "中西區",
        "lat": 22.9922,
        "lng": 120.1986
      },
      {
        "name": "東區",
        "lat": 22.9806,
        "lng": 120.2228
      },
      {
        "name": "南區",
        "lat": 22.9619,
        "lng": 120.1917
      },
      {
        "name": "北區",
        "lat": 23.0108,
        "lng": 120.2078
      },
      {
        "name": "安平區",
        "lat": 22.9986,
        "lng": 120.1664
      },
      {
        "name": "安南區",
        "lat": 23.0483,
        "lng": 120.1844
      },
      {
        "name": "永康區",
        "lat": 23.0264,
        "lng": 120.2569
      },
      {
        "name": "歸仁區",
        "lat": 22.9692,
        "lng": 120.2939
      },
      {
        "name": "新化區",
        "lat": 23.0389,
        "lng": 120.3111
      },
      {
        "name": "左鎮區",
        "lat": 23.0569,
        "lng": 120.3611
      },
      {
        "name": "玉井區",
        "lat": 23.1239,
        "lng": 120.4611
      },
      {
        "name": "楠西區",
        "lat": 23.1739,
        "lng": 120.4861
      },
      {
        "name": "南化區",
        "lat": 23.0419,
        "lng": 120.4789
      },
      {
        "name": "仁德區",
        "lat": 22.9719,
        "lng": 120.2528
      },
      {
        "name": "關廟區",
        "lat": 22.9619,
        "lng": 120.3278
      },
      {
        "name": "龍崎區",
        "lat": 22.9658,
        "lng": 120.3611
      },
      {
        "name": "官田區",
        "lat": 23.1889,
        "lng": 120.3167
      },
      {
        "name": "麻豆區",
        "lat": 23.1819,
        "lng": 120.2464
      },
      {
        "name": "佳里區",
        "lat": 23.1653,
        "lng": 120.1764
      },
      {
        "name": "西港區",
        "lat": 23.1219,
        "lng": 120.2039
      },
      {
        "name": "七股區",
        "lat": 23.1439,
        "lng": 120.1389
      },
      {
        "name": "將軍區",
        "lat": 23.1989,
        "lng": 120.1589
      },
      {
        "name": "學甲區",
        "lat": 23.2319,
        "lng": 120.1819
      },
      {
        "name": "北門區",
        "lat": 23.2689,
        "lng": 120.1264
      },
      {
        "name": "新營區",
        "lat": 23.3106,
        "lng": 120.3164
      },
      {
        "name": "後壁區",
        "lat": 23.3667,
        "lng": 120.3583
      },
      {
        "name": "白河區",
        "lat": 23.3519,
        "lng": 120.4158
      },
      {
        "name": "東山區",
        "lat": 23.3258,
        "lng": 120.4042
      },
      {
        "name": "六甲區",
        "lat": 23.2319,
        "lng": 120.3475
      },
      {
        "name": "下營區",
        "lat": 23.2361,
        "lng": 120.2644
      },
      {
        "name": "柳營區",
        "lat": 23.2789,
        "lng": 120.3117
      },
      {
        "name": "鹽水區",
        "lat": 23.3197,
        "lng": 120.2661
      },
      {
        "name": "善化區",
        "lat": 23.1322,
        "lng": 120.2964
      },
      {
        "name": "大內區",
        "lat": 23.1189,
        "lng": 120.3519
      },
      {
        "name": "山上區",
        "lat": 23.0989,
        "lng": 120.3519
      },
      {
        "name": "新市區",
        "lat": 23.0789,
        "lng": 120.2919
      },
      {
        "name": "安定區",
        "lat": 23.1069,
        "lng": 120.2369
      }
    ]
  },
  {
    "city": "高雄市",
    "lat": 22.6273,
    "lng": 120.3014,
    "districts": [
      {
        "name": "新興區",
        "lat": 22.6314,
        "lng": 120.3069
      },
      {
        "name": "前金區",
        "lat": 22.6272,
        "lng": 120.2939
      },
      {
        "name": "苓雅區",
        "lat": 22.6219,
        "lng": 120.3117
      },
      {
        "name": "鹽埕區",
        "lat": 22.6247,
        "lng": 120.2817
      },
      {
        "name": "鼓山區",
        "lat": 22.6592,
        "lng": 120.2789
      },
      {
        "name": "旗津區",
        "lat": 22.5708,
        "lng": 120.2858
      },
      {
        "name": "前鎮區",
        "lat": 22.5858,
        "lng": 120.3189
      },
      {
        "name": "三民區",
        "lat": 22.6467,
        "lng": 120.3139
      },
      {
        "name": "楠梓區",
        "lat": 22.7289,
        "lng": 120.3147
      },
      {
        "name": "小港區",
        "lat": 22.5658,
        "lng": 120.3397
      },
      {
        "name": "左營區",
        "lat": 22.6908,
        "lng": 120.2947
      },
      {
        "name": "仁武區",
        "lat": 22.7019,
        "lng": 120.3475
      },
      {
        "name": "大社區",
        "lat": 22.7308,
        "lng": 120.3467
      },
      {
        "name": "岡山區",
        "lat": 22.7986,
        "lng": 120.2958
      },
      {
        "name": "路竹區",
        "lat": 22.8558,
        "lng": 120.2619
      },
      {
        "name": "阿蓮區",
        "lat": 22.8839,
        "lng": 120.3289
      },
      {
        "name": "田寮區",
        "lat": 22.8758,
        "lng": 120.3589
      },
      {
        "name": "燕巢區",
        "lat": 22.7939,
        "lng": 120.3619
      },
      {
        "name": "橋頭區",
        "lat": 22.7569,
        "lng": 120.3058
      },
      {
        "name": "梓官區",
        "lat": 22.7619,
        "lng": 120.2667
      },
      {
        "name": "彌陀區",
        "lat": 22.7839,
        "lng": 120.2475
      },
      {
        "name": "永安區",
        "lat": 22.8189,
        "lng": 120.2269
      },
      {
        "name": "湖內區",
        "lat": 22.9069,
        "lng": 120.2169
      },
      {
        "name": "鳳山區",
        "lat": 22.6264,
        "lng": 120.3575
      },
      {
        "name": "大寮區",
        "lat": 22.6058,
        "lng": 120.3958
      },
      {
        "name": "林園區",
        "lat": 22.5028,
        "lng": 120.3969
      },
      {
        "name": "鳥松區",
        "lat": 22.6589,
        "lng": 120.3639
      },
      {
        "name": "大樹區",
        "lat": 22.6939,
        "lng": 120.4319
      },
      {
        "name": "旗山區",
        "lat": 22.8889,
        "lng": 120.4817
      },
      {
        "name": "美濃區",
        "lat": 22.8986,
        "lng": 120.5408
      },
      {
        "name": "六龜區",
        "lat": 22.9975,
        "lng": 120.6347
      },
      {
        "name": "內門區",
        "lat": 22.9439,
        "lng": 120.4619
      },
      {
        "name": "杉林區",
        "lat": 22.9719,
        "lng": 120.5389
      },
      {
        "name": "甲仙區",
        "lat": 23.0819,
        "lng": 120.5911
      },
      {
        "name": "桃源區",
        "lat": 23.1589,
        "lng": 120.7619
      },
      {
        "name": "那瑪夏區",
        "lat": 23.2169,
        "lng": 120.6939
      },
      {
        "name": "茂林區",
        "lat": 22.8858,
        "lng": 120.6639
      }
    ]
  },
  {
    "city": "屏東縣",
    "lat": 22.6761,
    "lng": 120.4942,
    "districts": [
      {
        "name": "屏東市",
        "lat": 22.6761,
        "lng": 120.4942
      },
      {
        "name": "三地門鄉",
        "lat": 22.7139,
        "lng": 120.6547
      },
      {
        "name": "霧臺鄉",
        "lat": 22.7489,
        "lng": 120.7289
      },
      {
        "name": "瑪家鄉",
        "lat": 22.6489,
        "lng": 120.6489
      },
      {
        "name": "九如鄉",
        "lat": 22.7389,
        "lng": 120.4919
      },
      {
        "name": "里港鄉",
        "lat": 22.7789,
        "lng": 120.4958
      },
      {
        "name": "高樹鄉",
        "lat": 22.8258,
        "lng": 120.5989
      },
      {
        "name": "鹽埔鄉",
        "lat": 22.7539,
        "lng": 120.5739
      },
      {
        "name": "長治鄉",
        "lat": 22.6789,
        "lng": 120.5289
      },
      {
        "name": "麟洛鄉",
        "lat": 22.6519,
        "lng": 120.5289
      },
      {
        "name": "竹田鄉",
        "lat": 22.5858,
        "lng": 120.5439
      },
      {
        "name": "內埔鄉",
        "lat": 22.6139,
        "lng": 120.5667
      },
      {
        "name": "萬丹鄉",
        "lat": 22.5889,
        "lng": 120.4858
      },
      {
        "name": "潮州鎮",
        "lat": 22.5508,
        "lng": 120.5428
      },
      {
        "name": "泰武鄉",
        "lat": 22.5858,
        "lng": 120.6319
      },
      {
        "name": "來義鄉",
        "lat": 22.5258,
        "lng": 120.6178
      },
      {
        "name": "萬巒鄉",
        "lat": 22.5719,
        "lng": 120.5678
      },
      {
        "name": "崁頂鄉",
        "lat": 22.5158,
        "lng": 120.5139
      },
      {
        "name": "新埤鄉",
        "lat": 22.4689,
        "lng": 120.5519
      },
      {
        "name": "南州鄉",
        "lat": 22.4919,
        "lng": 120.5119
      },
      {
        "name": "林邊鄉",
        "lat": 22.4339,
        "lng": 120.5139
      },
      {
        "name": "東港鎮",
        "lat": 22.4644,
        "lng": 120.4544
      },
      {
        "name": "琉球鄉",
        "lat": 22.3439,
        "lng": 120.3694
      },
      {
        "name": "佳冬鄉",
        "lat": 22.4189,
        "lng": 120.5519
      },
      {
        "name": "新園鄉",
        "lat": 22.5439,
        "lng": 120.4619
      },
      {
        "name": "枋寮鄉",
        "lat": 22.3658,
        "lng": 120.5939
      },
      {
        "name": "枋山鄉",
        "lat": 22.2589,
        "lng": 120.6558
      },
      {
        "name": "春日鄉",
        "lat": 22.3719,
        "lng": 120.6289
      },
      {
        "name": "獅子鄉",
        "lat": 22.2019,
        "lng": 120.7047
      },
      {
        "name": "車城鄉",
        "lat": 22.0722,
        "lng": 120.7119
      },
      {
        "name": "牡丹鄉",
        "lat": 22.1264,
        "lng": 120.7719
      },
      {
        "name": "恆春鎮",
        "lat": 22.0044,
        "lng": 120.7439
      },
      {
        "name": "滿州鄉",
        "lat": 22.0219,
        "lng": 120.8389
      }
    ]
  },
  {
    "city": "宜蘭縣",
    "lat": 24.757,
    "lng": 121.753,
    "districts": [
      {
        "name": "宜蘭市",
        "lat": 24.757,
        "lng": 121.753
      },
      {
        "name": "頭城鎮",
        "lat": 24.8589,
        "lng": 121.8239
      },
      {
        "name": "礁溪鄉",
        "lat": 24.8286,
        "lng": 121.7719
      },
      {
        "name": "壯圍鄉",
        "lat": 24.7456,
        "lng": 121.7856
      },
      {
        "name": "員山鄉",
        "lat": 24.7439,
        "lng": 121.7219
      },
      {
        "name": "羅東鎮",
        "lat": 24.6778,
        "lng": 121.7719
      },
      {
        "name": "三星鄉",
        "lat": 24.6644,
        "lng": 121.6508
      },
      {
        "name": "大同鄉",
        "lat": 24.6764,
        "lng": 121.6069
      },
      {
        "name": "五結鄉",
        "lat": 24.6858,
        "lng": 121.7997
      },
      {
        "name": "冬山鄉",
        "lat": 24.6364,
        "lng": 121.7925
      },
      {
        "name": "蘇澳鎮",
        "lat": 24.5958,
        "lng": 121.8486
      },
      {
        "name": "南澳鄉",
        "lat": 24.4619,
        "lng": 121.7989
      }
    ]
  },
  {
    "city": "花蓮縣",
    "lat": 23.9912,
    "lng": 121.6016,
    "districts": [
      {
        "name": "花蓮市",
        "lat": 23.9912,
        "lng": 121.6016
      },
      {
        "name": "新城鄉",
        "lat": 24.0322,
        "lng": 121.6067
      },
      {
        "name": "秀林鄉",
        "lat": 24.1564,
        "lng": 121.6219
      },
      {
        "name": "吉安鄉",
        "lat": 23.9575,
        "lng": 121.5708
      },
      {
        "name": "壽豐鄉",
        "lat": 23.8719,
        "lng": 121.5097
      },
      {
        "name": "鳳林鎮",
        "lat": 23.7439,
        "lng": 121.4508
      },
      {
        "name": "光復鄉",
        "lat": 23.6689,
        "lng": 121.4239
      },
      {
        "name": "豐濱鄉",
        "lat": 23.5989,
        "lng": 121.5178
      },
      {
        "name": "瑞穗鄉",
        "lat": 23.4986,
        "lng": 121.3789
      },
      {
        "name": "萬榮鄉",
        "lat": 23.7139,
        "lng": 121.4019
      },
      {
        "name": "玉里鎮",
        "lat": 23.3339,
        "lng": 121.3139
      },
      {
        "name": "卓溪鄉",
        "lat": 23.3489,
        "lng": 121.2989
      },
      {
        "name": "富里鄉",
        "lat": 23.1789,
        "lng": 121.2508
      }
    ]
  },
  {
    "city": "台東縣",
    "lat": 22.756,
    "lng": 121.1444,
    "districts": [
      {
        "name": "台東市",
        "lat": 22.756,
        "lng": 121.1444
      },
      {
        "name": "成功鎮",
        "lat": 23.1022,
        "lng": 121.3789
      },
      {
        "name": "關山鎮",
        "lat": 23.0458,
        "lng": 121.1639
      },
      {
        "name": "卑南鄉",
        "lat": 22.7847,
        "lng": 121.0839
      },
      {
        "name": "鹿野鄉",
        "lat": 22.9139,
        "lng": 121.1347
      },
      {
        "name": "池上鄉",
        "lat": 23.1239,
        "lng": 121.2189
      },
      {
        "name": "東河鄉",
        "lat": 22.9739,
        "lng": 121.3039
      },
      {
        "name": "長濱鄉",
        "lat": 23.3158,
        "lng": 121.4539
      },
      {
        "name": "太麻里鄉",
        "lat": 22.6158,
        "lng": 120.9964
      },
      {
        "name": "大武鄉",
        "lat": 22.3389,
        "lng": 120.8939
      },
      {
        "name": "綠島鄉",
        "lat": 22.6619,
        "lng": 121.4939
      },
      {
        "name": "海端鄉",
        "lat": 23.1019,
        "lng": 121.1789
      },
      {
        "name": "延平鄉",
        "lat": 22.9039,
        "lng": 121.0847
      },
      {
        "name": "金峰鄉",
        "lat": 22.5958,
        "lng": 120.9419
      },
      {
        "name": "達仁鄉",
        "lat": 22.2958,
        "lng": 120.8847
      },
      {
        "name": "蘭嶼鄉",
        "lat": 22.0569,
        "lng": 121.5347
      }
    ]
  },
  {
    "city": "澎湖縣",
    "lat": 23.5658,
    "lng": 119.5794,
    "districts": [
      {
        "name": "馬公市",
        "lat": 23.5658,
        "lng": 119.5794
      },
      {
        "name": "西嶼鄉",
        "lat": 23.6019,
        "lng": 119.5094
      },
      {
        "name": "望安鄉",
        "lat": 23.3589,
        "lng": 119.5019
      },
      {
        "name": "七美鄉",
        "lat": 23.2069,
        "lng": 119.4269
      },
      {
        "name": "白沙鄉",
        "lat": 23.6664,
        "lng": 119.5939
      },
      {
        "name": "湖西鄉",
        "lat": 23.5828,
        "lng": 119.6589
      }
    ]
  },
  {
    "city": "金門縣",
    "lat": 24.4367,
    "lng": 118.3236,
    "districts": [
      {
        "name": "金沙鎮",
        "lat": 24.4828,
        "lng": 118.4164
      },
      {
        "name": "金湖鎮",
        "lat": 24.4389,
        "lng": 118.4208
      },
      {
        "name": "金寧鄉",
        "lat": 24.4569,
        "lng": 118.3344
      },
      {
        "name": "金城鎮",
        "lat": 24.4367,
        "lng": 118.3236
      },
      {
        "name": "烈嶼鄉",
        "lat": 24.4289,
        "lng": 118.2464
      },
      {
        "name": "烏坵鄉",
        "lat": 24.9989,
        "lng": 119.4475
      }
    ]
  },
  {
    "city": "連江縣",
    "lat": 26.1558,
    "lng": 119.9519,
    "districts": [
      {
        "name": "南竿鄉",
        "lat": 26.1558,
        "lng": 119.9519
      },
      {
        "name": "北竿鄉",
        "lat": 26.2239,
        "lng": 119.9917
      },
      {
        "name": "莒光鄉",
        "lat": 25.9722,
        "lng": 119.9389
      },
      {
        "name": "東引鄉",
        "lat": 26.3689,
        "lng": 120.4939
      }
    ]
  }
];

export const FOOD_CATEGORIES = [
  '全部類別',
  '經典小吃',
  '傳統麵食',
  '海鮮熱炒',
  '火鍋鍋物',
  '早午餐/豆漿',
  '甜品冰品',
  '咖啡茶飲',
  '夜市必吃',
  '家庭聚餐',
  '其他',
];
